{
    "modelTopology": {
        "keras_version": "2.1.6",
        "backend": "tensorflow",
        "training_config": {
            "optimizer_config": {
                "config": {
                    "decay": 0.0,
                    "momentum": 3.000000106112566e-06,
                    "lr": 0.003000000026077032,
                    "nesterov": false
                },
                "class_name": "SGD"
            },
            "metrics": ["categorical_accuracy"],
            "loss": "categorical_crossentropy",
            "sample_weight_mode": null,
            "loss_weights": null
        },
        "model_config": {
            "config": [{
                "config": {
                    "output_dim": 500,
                    "batch_input_shape": [null, 50],
                    "embeddings_initializer": {
                        "config": {
                            "maxval": 0.05,
                            "minval": -0.05,
                            "seed": null
                        },
                        "class_name": "RandomUniform"
                    },
                    "dtype": "float32",
                    "input_dim": 95,
                    "input_length": 50,
                    "embeddings_regularizer": null,
                    "embeddings_constraint": null,
                    "name": "embedding_1",
                    "mask_zero": false,
                    "trainable": true,
                    "activity_regularizer": null
                },
                "class_name": "Embedding"
            }, {
                "config": {
                    "kernel_constraint": null,
                    "unroll": false,
                    "recurrent_initializer": {
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        },
                        "class_name": "Orthogonal"
                    },
                    "bias_regularizer": null,
                    "recurrent_regularizer": null,
                    "return_state": false,
                    "trainable": true,
                    "recurrent_dropout": 0.0,
                    "recurrent_constraint": null,
                    "use_bias": true,
                    "kernel_initializer": {
                        "config": {
                            "mode": "fan_avg",
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0
                        },
                        "class_name": "VarianceScaling"
                    },
                    "recurrent_activation": "hard_sigmoid",
                    "name": "lstm_1",
                    "dropout": 0.0,
                    "activation": "relu",
                    "go_backwards": false,
                    "units": 500,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "unit_forget_bias": true,
                    "activity_regularizer": null,
                    "stateful": false,
                    "implementation": 1,
                    "bias_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "return_sequences": true
                },
                "class_name": "LSTM"
            }, {
                "config": {
                    "kernel_constraint": null,
                    "unroll": false,
                    "recurrent_initializer": {
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        },
                        "class_name": "Orthogonal"
                    },
                    "bias_regularizer": null,
                    "recurrent_regularizer": null,
                    "return_state": false,
                    "trainable": true,
                    "recurrent_dropout": 0.0,
                    "recurrent_constraint": null,
                    "use_bias": true,
                    "kernel_initializer": {
                        "config": {
                            "mode": "fan_avg",
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0
                        },
                        "class_name": "VarianceScaling"
                    },
                    "recurrent_activation": "hard_sigmoid",
                    "name": "lstm_2",
                    "dropout": 0.0,
                    "activation": "relu",
                    "go_backwards": false,
                    "units": 500,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "unit_forget_bias": true,
                    "activity_regularizer": null,
                    "stateful": false,
                    "implementation": 1,
                    "bias_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "return_sequences": true
                },
                "class_name": "LSTM"
            }, {
                "config": {
                    "kernel_constraint": null,
                    "unroll": false,
                    "recurrent_initializer": {
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        },
                        "class_name": "Orthogonal"
                    },
                    "bias_regularizer": null,
                    "recurrent_regularizer": null,
                    "return_state": false,
                    "trainable": true,
                    "recurrent_dropout": 0.0,
                    "recurrent_constraint": null,
                    "use_bias": true,
                    "kernel_initializer": {
                        "config": {
                            "mode": "fan_avg",
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0
                        },
                        "class_name": "VarianceScaling"
                    },
                    "recurrent_activation": "hard_sigmoid",
                    "name": "lstm_3",
                    "dropout": 0.0,
                    "activation": "relu",
                    "go_backwards": false,
                    "units": 500,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "unit_forget_bias": true,
                    "activity_regularizer": null,
                    "stateful": false,
                    "implementation": 1,
                    "bias_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "return_sequences": true
                },
                "class_name": "LSTM"
            }, {
                "config": {
                    "center": true,
                    "beta_constraint": null,
                    "axis": -1,
                    "moving_mean_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "moving_variance_initializer": {
                        "config": {},
                        "class_name": "Ones"
                    },
                    "beta_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "scale": true,
                    "trainable": true,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "config": {},
                        "class_name": "Ones"
                    },
                    "epsilon": 0.001,
                    "name": "batch_normalization_1",
                    "gamma_constraint": null
                },
                "class_name": "BatchNormalization"
            }, {
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "rate": 0.5,
                    "seed": null,
                    "noise_shape": null
                },
                "class_name": "Dropout"
            }, {
                "config": {
                    "name": "time_distributed_1",
                    "trainable": true,
                    "layer": {
                        "config": {
                            "kernel_constraint": null,
                            "units": 95,
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "mode": "fan_avg",
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0
                                },
                                "class_name": "VarianceScaling"
                            },
                            "trainable": true,
                            "use_bias": true,
                            "name": "dense_1",
                            "activation": "linear",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            }
                        },
                        "class_name": "Dense"
                    }
                },
                "class_name": "TimeDistributed"
            }, {
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "softmax"
                },
                "class_name": "Activation"
            }],
            "class_name": "Sequential"
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"],
        "weights": [{
            "name": "embedding_1/embeddings",
            "dtype": "float32",
            "shape": [95, 500]
        }, {
            "name": "lstm_1/kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_1/recurrent_kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_1/bias",
            "dtype": "float32",
            "shape": [2000]
        }, {
            "name": "lstm_2/kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_2/recurrent_kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_2/bias",
            "dtype": "float32",
            "shape": [2000]
        }, {
            "name": "lstm_3/kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_3/recurrent_kernel",
            "dtype": "float32",
            "shape": [500, 2000]
        }, {
            "name": "lstm_3/bias",
            "dtype": "float32",
            "shape": [2000]
        }, {
            "name": "time_distributed_1/kernel",
            "dtype": "float32",
            "shape": [500, 95]
        }, {
            "name": "time_distributed_1/bias",
            "dtype": "float32",
            "shape": [95]
        }]
    }]
}
