{"weightsManifest": [{"weights": [{"shape": [500], "dtype": "float32", "name": "batch_normalization_1_1/gamma"}, {"shape": [500], "dtype": "float32", "name": "batch_normalization_1_1/beta"}, {"shape": [500], "dtype": "float32", "name": "batch_normalization_1_1/moving_mean"}, {"shape": [500], "dtype": "float32", "name": "batch_normalization_1_1/moving_variance"}, {"shape": [95, 500], "dtype": "float32", "name": "embedding_1_1/embeddings"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_1_1/kernel"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_1_1/recurrent_kernel"}, {"shape": [2000], "dtype": "float32", "name": "lstm_1_1/bias"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_2_1/kernel"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_2_1/recurrent_kernel"}, {"shape": [2000], "dtype": "float32", "name": "lstm_2_1/bias"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_3_1/kernel"}, {"shape": [500, 2000], "dtype": "float32", "name": "lstm_3_1/recurrent_kernel"}, {"shape": [2000], "dtype": "float32", "name": "lstm_3_1/bias"}, {"shape": [500, 95], "dtype": "float32", "name": "time_distributed_1_1/kernel"}, {"shape": [95], "dtype": "float32", "name": "time_distributed_1_1/bias"}], "paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"]}], "modelTopology": {"backend": "tensorflow", "training_config": {"metrics": ["categorical_accuracy"], "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"config": {"momentum": 3.000000106112566e-06, "nesterov": false, "decay": 0.0, "lr": 0.003000000026077032}, "class_name": "SGD"}, "loss": "categorical_crossentropy"}, "keras_version": "2.1.6", "model_config": {"config": [{"config": {"input_length": 50, "name": "embedding_1", "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 50], "output_dim": 500, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_dim": 95, "embeddings_constraint": null, "dtype": "float32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 500, "return_state": false, "activation": "relu", "stateful": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "go_backwards": false, "activity_regularizer": null, "implementation": 1}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "lstm_2", "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 500, "return_state": false, "activation": "relu", "stateful": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "go_backwards": false, "activity_regularizer": null, "implementation": 1}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "lstm_3", "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 500, "return_state": false, "activation": "relu", "stateful": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "go_backwards": false, "activity_regularizer": null, "implementation": 1}, "class_name": "LSTM"}, {"config": {"momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "epsilon": 0.001, "beta_constraint": null, "scale": true, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "units": 95, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, "trainable": true, "name": "time_distributed_1"}, "class_name": "TimeDistributed"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}}}